import * as yup from "yup";

const passwordRegex =
  /^(?=.*[a-z])(?=.*[A-Z])(?=.*\d)(?=.*[@$!%*#?&_])[A-Za-z\d@$!%*#?&_]{8,30}$/;
const emailRegex = /^[^\s@]+@[^\s@]+\.[^\s@]{2,}$/i;

const schema = yup.object({
  name: yup
    .string()
    .required("وارد کردن نام اجباری می‌باشد")
    .min(3, "نام باید حداقل ۳ کاراکتر داشته باشد")
    .max(30, "نام نمی‌تواند بیشتر از ۳۰ کاراکتر باشد")
    .matches(/^[آ-یa-zA-Z\s]+$/, "نام فقط باید شامل حروف باشد"),

  email: yup
    .string()
    .required("وارد کردن ایمیل اجباری می‌باشد")
    .matches(emailRegex, "ایمیل وارد شده معتبر نیست")
    .min(10, "ایمیل حداقل باید ۱۰ کاراکتر داشته باشد")
    .max(50, "ایمیل نمی‌تواند بیشتر از ۵۰ کاراکتر باشد"),

  password: yup
    .string()
    .required("وارد کردن رمز عبور اجباری می‌باشد")
    .matches(
      passwordRegex,
      "رمز عبور باید شامل حروف بزرگ، کوچک، عدد و یک علامت خاص باشد"
    )
    .min(8, "رمز عبور حداقل باید ۸ کاراکتر باشد")
    .max(30, "رمز عبور نمی‌تواند بیشتر از ۳۰ کاراکتر باشد"),

  roles: yup
    .boolean()
    .oneOf([true], "قبول کردن قوانین و مقررات اجباری می‌باشد")
    .required("قبول کردن قوانین و مقررات اجباری می‌باشد"),
});

export default schema;
